app/Http/Controllers/FrontEnd/Auth/RegisterController.php

select * from `users` where `email` = 'jamybyga@mailinator.com' limit 1
select * from `roles` where `name` = 'company' limit 1
---
    public function store(RegisterRequest $request,User $user)
    {
        try {

            $duplicate = User::where('email',$request->email)->first();
            if($duplicate){
                return  response(['message'=>'User Already Exist','status'=>'error']);
            }

            $user->name = $request->name;
            $user->email = $request->email;
            $user->phone_number = $request->phoneNumber;
            $user->password = Hash::make($request->password);
            $user->save();

            $check_role = Role::where('name' ,strtolower($request->role))->first();